supervision/feb1010wk5wk6/meeting_notes.org
#+LATEX_CLASS: article
#+LATEX_HEADER: \usepackage[margin=1in]{geometry}
#+LATEX_COMPILER: pdflatex
#+DATE: \today
 

#+BEGIN_EXPORT latex
\newpage
#+END_EXPORT
* Questions for Krasy
    - How do you produce bifurcation diagrams on the surface of a sphere, like those in your paper?

    - How do you find the slow subsystem paths? Trial and error?
      - Given a bifurcation diagram, it seems hard to find paths that actually correspond to bursting. Even finding the right start and end bifurcations and linking them won't necessarily produce a burstable trajectory.
      - Why are we looking at bifurcations on the surface of the sphere? Is it just as a convenient dimensionality reduction? Is there any a priori reason why this surface should have contained the burster path, or was that just a lucky bit of guesswork?

    - Where are you getting the parameter values for the bifurcation regions?
      - Golubitsky uses b=3, mu2 = 1/3. Why?
      - This paper fixes something like b=0.75. Why? Surely then it isn't a codim4 unfolding?
      - The paper claims that for small b (here, b=0.75), any fixed neighbourhood (here the unit ball) around the origin of (mu1,mu2,v) space contains all the additional bifurcations gained from the DD-BT pt. Why? How and why was b=0.75 chosen? How about the unit ball?
      - I don't understand why we're able to fix b at some small value and not limit the types of bifurcation that we see; why does any fixed neighbourhood of 0 in (mu1,mu2,v)-space contain all the relevant bifurcations for sufficiently small b?

    - How do you expect the model to be used?
      - Would I trial and error some parameter vals from a bifurcation diagram diagram, to find the areas of parameter space that give whatever bursting/excitability dynamics I'm interested in studying?
      - How biologically relevant is this model, being a phenomenological one? Will it be able to tell me much about what a living neuron is doing? How much information can we get using it to describe a living cell, if we don't consider the different ionic currents?
      - Is there any nice methods for relating the parameters and parameter values back to what's going on in the live cell? Any real-world interpretation of them?

Notes:
    - In the cubic Lienard model, mu1 is the slow subsystem variable (z), and v is the HR-b-like bursting pattern variable

#+BEGIN_EXPORT latex
\newpage
#+END_EXPORT
* Continuation software
** Notes
*** ODE examples
**** XPP
**** COCO
**** MATCONT
**** PyDSTool

*** Pure AUTO capabilities
**** Algebraics
    - Compute sol'n families for algebraic eq's of form \(f(u,p)=0\), \(f(\cdot,\cdot) \in \mathbb{R}^n\)
    - Find branch points, and continue them in two or three parameters
    - Find Hopf points, continue them in two parameters, detect criticality, find zero-Hopf, BT, Bautins
    - Find folds, continue in 2 parameters, find cusps, zero-Hopfs, BTs
    - Find branch points, folds, period doubling, Neimark-Sackers, continue these in 2 or 3 params and switch branches at branch points and PD bifs for map fixed points
    - Find extrema of ojective functions along solution families; continue extrema in more params

**** Flows
 Consider an ODE of form \(u'(t) = f\big(u(t), p\big)\), \(f(\cdot, \cdot),~u(\cdot) \in \mathbb{R}^n\).
 AUTO can...
    - Compute stable / unstable periodic sol'n families, and their Floquet multipliers
    - Find folds, branch points, period doublings, Neimark-Sackers, along PO families; branch switching at PO and PD bifs
    - Continue folds, PD bifs, NS bifs in two parameters, and detect 1:{1,2,3,4} resonances
    - Continuation of fixed-period orbits for sufficiently large periods
    - Follow curves of homoclinic orbits, detect and continue codim-2 bifs using HomCont
    - Find extrema of integral objective functions along a periodic solution family; continue extrema in more parameters
    - Compute sol'n curves on the unit interval, subject to nonlinear BCs and integral conditions; discretisation uses an adaptive-mesh orthogonal collocation
    - Determine fold, branch points along sol'n families to the above BVP
**** PDEs
     Also some stuff for reaction-diffusion equations.

*** Things to put in the paper
  Table of comparison:
	  - Bifurcations it can do, curves it can continue, and the types of system they can use
	  - When they fail, crash, etc.
	  - Numerical methods they have available
	  - How much do the parameters need manually fiddling?
	  - Do we need to code or not?

  When writing, aim it at a biology audience.
  Continuation is a sequence of problems - start off at equilibria, then move to tracking codim2 bifurcations, increase the dimension etc.
  Make this nice and clear: explain why we're starting off finding any sorts of bifurcations we can, then continuing those to find others.
  Aim it at someone that doesn't understand continuation (assume they know what bifurcations are, but not continuation methods for finding them).
  A brief section on the maths (eg. why we need to continue from a steady state, and how continuation works) would probably be useful.
*** Investigating the HR model
**** Simplifying assumptions
     - b is a parameter influencing the bursting and spiking behaviour (frequency of spiking, ability or inability to burst)
     - We want to find the start/stop bifurcations when in a spiking regime, so we fix I=2 to force the neuron to spike
     - Freeze the fast subsystem (so, ignore the slow subsystem)
     - We therefore have two bifurcation parameters - slow subsystem state z, and bursting-spiking parameter b
**** Investigation strategy
     - Simulate the neuron for a few different b,z, to see what happens
     - It spikes
     - If the neuron can spike there must be a limit cycle; if there's a planar limit cycle, there must be an equilibrium within it
     - We're interested in when this limit cycle appears or disappears; let's start by investigating how its central equilibrium bifurcates
