supervision/feb1010wk5wk6/meeting_notes.tex
% Created 2020-02-17 Mon 08:50
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[margin=1in]{geometry}
\author{mark}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={mark},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.3 (Org mode 9.1.9)}, 
 pdflang={English}}
\begin{document}

\tableofcontents

\newpage
\section{Questions for Krassy}
\label{sec:org0759dda}
\begin{itemize}
\item How do you produce bifurcation diagrams on the surface of a sphere, like those in your paper?

\item How do you find the slow subsystem paths? Trial and error?
\begin{itemize}
\item Given a bifurcation diagram, it seems hard to find paths that actually correspond to bursting. Even finding the right start and end bifurcations and linking them won't necessarily produce a burstable trajectory.
\item Why are we looking at bifurcations on the surface of the sphere? Is it just as a convenient dimensionality reduction? Is there any a priori reason why this surface should have contained the burster path, or was that just a lucky bit of guesswork?
\end{itemize}

\item Where are you getting the parameter values for the bifurcation regions?
\begin{itemize}
\item Golubitsky uses b=3, mu2 = 1/3. Why?
\item This paper fixes something like b=0.75. Why? Surely then it isn't a codim4 unfolding?
\item The paper claims that for small b (here, b=0.75), any fixed neighbourhood (here the unit ball) around the origin of (mu1,mu2,v) space contains all the additional bifurcations gained from the DD-BT pt. Why? How and why was b=0.75 chosen? How about the unit ball?
\item I don't understand why we're able to fix b at some small value and not limit the types of bifurcation that we see; why does any fixed neighbourhood of 0 in (mu1,mu2,v)-space contain all the relevant bifurcations for sufficiently small b?
\end{itemize}

\item How do you expect the model to be used?
\begin{itemize}
\item Would I trial and error some parameter vals from a bifurcation diagram diagram, to find the areas of parameter space that give whatever bursting/excitability dynamics I'm interested in studying?
\item How biologically relevant is this model, being a phenomenological one? Will it be able to tell me much about what a living neuron is doing? How much information can we get using it to describe a living cell, if we don't consider the different ionic currents?
\item Is there any nice methods for relating the parameters and parameter values back to what's going on in the live cell? Any real-world interpretation of them?
\end{itemize}
\end{itemize}

Notes:
\begin{itemize}
\item In the cubic Lienard model, mu1 is the slow subsystem variable (z), and v is the HR-b-like bursting pattern variable
\end{itemize}

\newpage
\section{Continuation software}
\label{sec:orga68b1c0}
\subsection{Notes}
\label{sec:orgb41ee43}
\subsubsection{ODE examples}
\label{sec:org2311a42}
\begin{enumerate}
\item XPP
\label{sec:org387e062}
\item COCO
\label{sec:orgdec56b3}
\item MATCONT
\label{sec:orgda7eee0}
\item PyDSTool
\label{sec:org1da023a}
\end{enumerate}

\subsubsection{Pure AUTO capabilities}
\label{sec:orge1b9861}
\begin{enumerate}
\item Algebraics
\label{sec:org47ccdf1}
\begin{itemize}
\item Compute sol'n families for algebraic eq's of form \(f(u,p)=0\), \(f(\cdot,\cdot) \in \mathbb{R}^n\)
\item Find branch points, and continue them in two or three parameters
\item Find Hopf points, continue them in two parameters, detect criticality, find zero-Hopf, BT, Bautins
\item Find folds, continue in 2 parameters, find cusps, zero-Hopfs, BTs
\item Find branch points, folds, period doubling, Neimark-Sackers, continue these in 2 or 3 params and switch branches at branch points and PD bifs for map fixed points
\item Find extrema of ojective functions along solution families; continue extrema in more params
\end{itemize}

\item Flows
\label{sec:org3bb2fac}
Consider an ODE of form \(u'(t) = f\big(u(t), p\big)\), \(f(\cdot, \cdot),~u(\cdot) \in \mathbb{R}^n\).
AUTO can\ldots{}
\begin{itemize}
\item Compute stable / unstable periodic sol'n families, and their Floquet multipliers
\item Find folds, branch points, period doublings, Neimark-Sackers, along PO families; branch switching at PO and PD bifs
\item Continue folds, PD bifs, NS bifs in two parameters, and detect 1:\{1,2,3,4\} resonances
\item Continuation of fixed-period orbits for sufficiently large periods
\item Follow curves of homoclinic orbits, detect and continue codim-2 bifs using HomCont
\item Find extrema of integral objective functions along a periodic solution family; continue extrema in more parameters
\item Compute sol'n curves on the unit interval, subject to nonlinear BCs and integral conditions; discretisation uses an adaptive-mesh orthogonal collocation
\item Determine fold, branch points along sol'n families to the above BVP
\end{itemize}
\item PDEs
\label{sec:org609284d}
Also some stuff for reaction-diffusion equations.
\end{enumerate}

\subsubsection{Things to put in the paper}
\label{sec:orgfc18e6b}
Table of comparison:
\begin{itemize}
\item Bifurcations it can do, curves it can continue, and the types of system they can use
\item When they fail, crash, etc.
\item Numerical methods they have available
\item How much do the parameters need manually fiddling?
\item Do we need to code or not?
\end{itemize}

When writing, aim it at a biology audience.
Continuation is a sequence of problems - start off at equilibria, then move to tracking codim2 bifurcations, increase the dimension etc.
Make this nice and clear: explain why we're starting off finding any sorts of bifurcations we can, then continuing those to find others.
Aim it at someone that doesn't understand continuation (assume they know what bifurcations are, but not continuation methods for finding them).
A brief section on the maths (eg. why we need to continue from a steady state, and how continuation works) would probably be useful.
\subsubsection{Investigating the HR model}
\label{sec:org1f8ea72}
\begin{enumerate}
\item Simplifying assumptions
\label{sec:org4466835}
\begin{itemize}
\item b is a parameter influencing the bursting and spiking behaviour (frequency of spiking, ability or inability to burst)
\item We want to find the start/stop bifurcations when in a spiking regime, so we fix I=2 to force the neuron to spike
\item Freeze the fast subsystem (so, ignore the slow subsystem)
\item We therefore have two bifurcation parameters - slow subsystem state z, and bursting-spiking parameter b
\end{itemize}
\item Investigation strategy
\label{sec:org1a40d38}
\begin{itemize}
\item Simulate the neuron for a few different b,z, to see what happens
\item It spikes
\item If the neuron can spike there must be a limit cycle; if there's a planar limit cycle, there must be an equilibrium within it
\item We're interested in when this limit cycle appears or disappears; let's start by investigating how its central equilibrium bifurcates
\end{itemize}
\begin{enumerate}
