supervision/feb1010wk5wk6/meeting_notes.org
***** Equilibrium bifurcation
      (1) Find the equilibrium
	 - Simulate the system to get a (x,y) phase portrait, for arbitrary initial conditions, params
	   * Wikipedia says b=3 is a sensible value, so let's use that to start with
	   * The simulations seem to show I=2 as being a nice (but arbitrarily chosen!) value, so let's use that too
	   * (Emphasise that these were chosen just by playing around with simulations)
	 - This shows a stable limit cycle
	 - Choose some point within the limit cycle and integrate backwards
	 - This allows us to find the (unstable!) equilibrium in the middle of the limit cycle
	   - For I=2, b=3, other params at wikipedia default, this gives an equilibrium at x,y=1,-4
      (2) Do a bifurcation analysis in Z of this equilibrium 
	 - We choose to bifurcate in Z since this is the forcing term applied by the slow subsystem that causes bursting
	 - Since we have a 1d slow subsystem, we must have a hysteresis-loop burster; hyseteresis-loops typically have a Z-shaped nullcline, so let's guess that's going to be the case and plot a bifurcation diagram in (z,x) space
	 - We get two LPs and two Hopf's; the first of these Hopfs occurs at z<-10; this is outside the expected range of z for a typical HR firing, so we'll ignore this one and focus on the other three bifs
      (3) Continue the bifurcations in (z,b) space
	 - Get confused and give up?

*** Refs
    [1] http://www.math.pitt.edu/~bard/xpp/whatis.html

    [2] K. Engelborghs, T.Luzyanina, G. Samaey, DDE-BIFTOOL v. 2.00: a Matlab package for bifurcation analysis of delay differential equations, Technical Report TW-330, Department of Computer Science, K.U.Leuven, Leuven, Belgium, 2001.

    [3] https://www.dropbox.com/s/cx2ex5o4n4q42ov/manual_v8.pdf?dl=0

    [4] https://github.com/robclewley/pydstool

    [5] https://pydstool.github.io/PyDSTool/FrontPage.html

** Tools overview
*** ODEs
**** XPP
***** Overview
      - Language: C
      - Interface: GUI only
      - Usage: ODEs, DDEs, SDEs, BVPs, difference equations, functional equations
      - License: GNU GPL V3
***** Notes
      The 'classic' simulation and continuation software.
      Still sees active use in a large range of nonlinear problems.
      Bifurcation (continuation) methods provided by AUTO and HomCont; probably possible to use AUTO by itself, but no one does because it would be very difficult (needs FORTRAN coding), and XPP provides a good interface to do it.
      Takes plain-text input files, with equations written out in text, as opposed to being defined by user-written functions like in eg. matlab.
      From [1], ...
      Over a dozen different solvers, covering stiff systems, integral equations, etc.
      Supports Poincare sections, nullcline plotting, flow fields, etc., so it's good for visualisation, as well as bifurcation analysis.
      Can produce animations in it (somehow?).
      Since it's so popular, there's a wealth of tutorials available for it.
      Somewhat outdated GUI, but it does the job perfectly adequately.
      No command line interface.
      Buggy, sometimes segfaults.
***** Tutorials
      Comprehensive tutorial provided by Ermentrout here: http://www.math.pitt.edu/~bard/bardware/tut/start.html#toc
**** TODO COCO
***** Overview
***** Notes
***** Tutorials
**** TODO MatCont
***** Overview
      - Language: MATLAB
      - Interface: GUI only, but CL_MatCont exists as a command-line version
      - Usage: """""TODO""""""
      - License: Creative Commons Attribution-NonCommercial-ShareAlike 3.0 unported
***** Notes
      Also: CL_MatCont (commandline interface), MatContM (MatCont for maps)
***** Tutorials
**** PyDSTool
     See [[https://pydstool.github.io/PyDSTool/ProjectOverview.html][the project overview]] for lots of nice interesting things to talk about
***** Overview
      - Language: Python3, with options for invoking C, Fortran
      - Interface: scripting only
      - Usage: ODEs, DAEs, discrete maps, and hybrid models thereof; some support for DDEs
      - License: BSD 3-clause
***** Notes
      Julia DS library is just PyDSTool in a julia wrapper.
      Provides a full set of tools for development, simulation, and analysis of dynamical system models.
      'supports symbolic math, optimisation, phase plane analysis, continuation and bifurcation analysis, data analysis,' etc. (quoted from [5]).
      Easy to build into existing code.
      Can reuse bits and pieces (eg. continuation, or modelling) for building more complex software.
***** Tutorials
      Learn-by-example tutorials provided in the examples directory of the code repo [4], and fairly comprehensive documentation available on the website [5].
*** Others
**** DDE Biftool
***** Overview
      - Language: MATLAB
      - Interface: Scripting
      - Usage: DDEs, sd-DDEs
      - License: BSD 2-clause
***** Notes
      DDE bifurcation analysis only.
      Described in detail at http://twr.cs.kuleuven.be/research/software/delay/ddebiftool.shtml .
      Full manual available at [2].
      Designed for numerical bifurcation analysis of fixed points and periodic orbits, in constant-delay differential equations, and in state-dependent-delay differential equations.
      Uses orthogonal collocation (???) to continue steady states, periodic orbits.
      Doesn't provide automatic bifurcation detection, but instead tracks eigenvalue evolution, so that the user can determine bifurcation points.
      No simulation ability.
**** Knut
***** Overview
      - Language: C++
      - Interface: GUI, CLI
      - Usage: explicitly time-dependent-delay DDEs
      - License: GNU GPL
***** Notes
****** Features:
       [Info taken verbatim from https://rs1909.github.io/knut/]:
       - Continuation of periodic orbits along a parameter
       - Floquet multiplier calculations
       - Automatic bifurcation detection
       - Continuation of some bifurcations in 2 parameters
****** Differences from DDE Biftool:
       [Info taken from https://rs1909.github.io/knut/]:
       - C++ makes it faster than MATLAB
       - Standalone software (no need to install matlab as well)
       - GUI-based, with plaintext input, so no need for any programming skills to use it
       - Only software to calculate quasi-periodic tori
***** Tutorials
      See reference manual [3] for how-to's
**** PDECONT
***** Overiew
      - Language: C
      - Interface: combination of C and a config file. Matlab interface appears to exist, but no documentation for how to use it
      - Usage: PDE discretisations, large systems of ODEs
      - License: unspecified (open-source, and free for non-commerial use)
***** Notes
      Huge long documentation file exists, but that's just full of code implementations. 
      Couldn't find any clear, straightforward tutorials for using it.
      Need to code in C and produce a big config file to use the software.
      Even then, I can't tell what the code is actually designed to do...
** Tables
