supervision/feb1010wk5wk6/meeting_notes.tex
\item Equilibrium bifurcation
\label{sec:org6821a09}
(1) Find the equilibrium
\begin{itemize}
\item Simulate the system to get a (x,y) phase portrait, for arbitrary initial conditions, params
\begin{itemize}
\item Wikipedia says b=3 is a sensible value, so let's use that to start with
\item The simulations seem to show I=2 as being a nice (but arbitrarily chosen!) value, so let's use that too
\item (Emphasise that these were chosen just by playing around with simulations)
\end{itemize}
\item This shows a stable limit cycle
\item Choose some point within the limit cycle and integrate backwards
\item This allows us to find the (unstable!) equilibrium in the middle of the limit cycle
\begin{itemize}
\item For I=2, b=3, other params at wikipedia default, this gives an equilibrium at x,y=1,-4
\end{itemize}
\end{itemize}
(2) Do a bifurcation analysis in Z of this equilibrium 
\begin{itemize}
\item We choose to bifurcate in Z since this is the forcing term applied by the slow subsystem that causes bursting
\item Since we have a 1d slow subsystem, we must have a hysteresis-loop burster; hyseteresis-loops typically have a Z-shaped nullcline, so let's guess that's going to be the case and plot a bifurcation diagram in (z,x) space
\item We get two LPs and two Hopf's; the first of these Hopfs occurs at z<-10; this is outside the expected range of z for a typical HR firing, so we'll ignore this one and focus on the other three bifs
\end{itemize}
(3) Continue the bifurcations in (z,b) space
\begin{itemize}
\item Get confused and give up?
\end{itemize}
\end{enumerate}
\end{enumerate}

\subsubsection{Refs}
\label{sec:org59cce46}
[1] \url{http://www.math.pitt.edu/\~bard/xpp/whatis.html}

[2] K. Engelborghs, T.Luzyanina, G. Samaey, DDE-BIFTOOL v. 2.00: a Matlab package for bifurcation analysis of delay differential equations, Technical Report TW-330, Department of Computer Science, K.U.Leuven, Leuven, Belgium, 2001.

[3] \url{https://www.dropbox.com/s/cx2ex5o4n4q42ov/manual\_v8.pdf?dl=0}

[4] \url{https://github.com/robclewley/pydstool}

[5] \url{https://pydstool.github.io/PyDSTool/FrontPage.html}

\subsection{Tools overview}
\label{sec:orgf02af9e}
\subsubsection{ODEs}
\label{sec:org40095ef}
\begin{enumerate}
\item XPP
\label{sec:org67a7acc}
\begin{enumerate}
\item Overview
\label{sec:orga63382b}
\begin{itemize}
\item Language: C
\item Interface: GUI only
\item Usage: ODEs, DDEs, SDEs, BVPs, difference equations, functional equations
\item License: GNU GPL V3
\end{itemize}
\item Notes
\label{sec:org3e639e7}
The 'classic' simulation and continuation software.
Still sees active use in a large range of nonlinear problems.
Bifurcation (continuation) methods provided by AUTO and HomCont; probably possible to use AUTO by itself, but no one does because it would be very difficult (needs FORTRAN coding), and XPP provides a good interface to do it.
Takes plain-text input files, with equations written out in text, as opposed to being defined by user-written functions like in eg. matlab.
From [1], \ldots{}
Over a dozen different solvers, covering stiff systems, integral equations, etc.
Supports Poincare sections, nullcline plotting, flow fields, etc., so it's good for visualisation, as well as bifurcation analysis.
Can produce animations in it (somehow?).
Since it's so popular, there's a wealth of tutorials available for it.
Somewhat outdated GUI, but it does the job perfectly adequately.
No command line interface.
Buggy, sometimes segfaults.
\item Tutorials
\label{sec:org8475dda}
Comprehensive tutorial provided by Ermentrout here: \url{http://www.math.pitt.edu/\~bard/bardware/tut/start.html\#toc}
\end{enumerate}
\item {\bfseries\sffamily TODO} COCO
\label{sec:org42e13e1}
\begin{enumerate}
\item Overview
\label{sec:orgfde71e9}
\item Notes
\label{sec:orge7da8bd}
\item Tutorials
\label{sec:org1ab73e9}
\end{enumerate}
\item {\bfseries\sffamily TODO} MatCont
\label{sec:org806501d}
\begin{enumerate}
\item Overview
\label{sec:org5920a3e}
\begin{itemize}
\item Language: MATLAB
\item Interface: GUI only, but CL\(_{\text{MatCont}}\) exists as a command-line version
\item Usage: """""TODO""""""
\item License: Creative Commons Attribution-NonCommercial-ShareAlike 3.0 unported
\end{itemize}
\item Notes
\label{sec:orge540e4c}
Also: CL\(_{\text{MatCont}}\) (commandline interface), MatContM (MatCont for maps)
\item Tutorials
\label{sec:orgcc53d85}
\end{enumerate}
\item PyDSTool
\label{sec:orgd7a0dee}
See \href{https://pydstool.github.io/PyDSTool/ProjectOverview.html}{the project overview} for lots of nice interesting things to talk about
\begin{enumerate}
\item Overview
\label{sec:org143f13e}
\begin{itemize}
\item Language: Python3, with options for invoking C, Fortran
\item Interface: scripting only
\item Usage: ODEs, DAEs, discrete maps, and hybrid models thereof; some support for DDEs
\item License: BSD 3-clause
\end{itemize}
\item Notes
\label{sec:org1b50bc9}
Julia DS library is just PyDSTool in a julia wrapper.
Provides a full set of tools for development, simulation, and analysis of dynamical system models.
'supports symbolic math, optimisation, phase plane analysis, continuation and bifurcation analysis, data analysis,' etc. (quoted from [5]).
Easy to build into existing code.
Can reuse bits and pieces (eg. continuation, or modelling) for building more complex software.
\item Tutorials
\label{sec:orgb65370b}
Learn-by-example tutorials provided in the examples directory of the code repo [4], and fairly comprehensive documentation available on the website [5].
\end{enumerate}
\end{enumerate}
\subsubsection{Others}
\label{sec:org4c4d449}
\begin{enumerate}
\item DDE Biftool
\label{sec:org24af428}
\begin{enumerate}
\item Overview
\label{sec:org8c8af7a}
\begin{itemize}
\item Language: MATLAB
\item Interface: Scripting
\item Usage: DDEs, sd-DDEs
\item License: BSD 2-clause
\end{itemize}
\item Notes
\label{sec:orgf60bc1b}
DDE bifurcation analysis only.
Described in detail at \url{http://twr.cs.kuleuven.be/research/software/delay/ddebiftool.shtml} .
Full manual available at [2].
Designed for numerical bifurcation analysis of fixed points and periodic orbits, in constant-delay differential equations, and in state-dependent-delay differential equations.
Uses orthogonal collocation (???) to continue steady states, periodic orbits.
Doesn't provide automatic bifurcation detection, but instead tracks eigenvalue evolution, so that the user can determine bifurcation points.
No simulation ability.
\end{enumerate}
\item Knut
\label{sec:orgbf79300}
\begin{enumerate}
\item Overview
\label{sec:org0109710}
\begin{itemize}
\item Language: C++
\item Interface: GUI, CLI
\item Usage: explicitly time-dependent-delay DDEs
\item License: GNU GPL
\end{itemize}
\item Notes
\label{sec:org944412e}
\begin{enumerate}
\item Features:
\label{sec:orgbf27e1a}
[Info taken verbatim from \url{https://rs1909.github.io/knut/}]:
\begin{itemize}
\item Continuation of periodic orbits along a parameter
\item Floquet multiplier calculations
\item Automatic bifurcation detection
\item Continuation of some bifurcations in 2 parameters
\end{itemize}
\item Differences from DDE Biftool:
\label{sec:org0968ddf}
[Info taken from \url{https://rs1909.github.io/knut/}]:
\begin{itemize}
\item C++ makes it faster than MATLAB
\item Standalone software (no need to install matlab as well)
\item GUI-based, with plaintext input, so no need for any programming skills to use it
\item Only software to calculate quasi-periodic tori
\end{itemize}
\end{enumerate}
\item Tutorials
\label{sec:orge83d5e4}
See reference manual [3] for how-to's
\end{enumerate}
\item PDECONT
\label{sec:org6171898}
\begin{enumerate}
\item Overiew
\label{sec:orgdb251a1}
\begin{itemize}
\item Language: C
\item Interface: combination of C and a config file. Matlab interface appears to exist, but no documentation for how to use it
\item Usage: PDE discretisations, large systems of ODEs
\item License: unspecified (open-source, and free for non-commerial use)
\end{itemize}
\item Notes
\label{sec:org0a805b5}
Huge long documentation file exists, but that's just full of code implementations. 
Couldn't find any clear, straightforward tutorials for using it.
Need to code in C and produce a big config file to use the software.
Even then, I can't tell what the code is actually designed to do\ldots{}
\end{enumerate}
\end{enumerate}
