supervision/feb1010wk5wk6/meeting_notes.org
*** Point labels

 | Point | Label                       | Also known as                                      |
 |-------+-----------------------------+----------------------------------------------------|
 | EP    | Equilibrium                 |                                                    |
 | LC    | Limit cycle                 |                                                    |
 | LP    | Limit point                 | Fold bifurcation, saddle node bifurcation          |
 | H     | Hopf                        | Andronov-Hopf bifurcation                          |
 | LPC   | Limit point of cycles       | Fold / saddle node bifurcation of periodics        |
 | NS    | Neimark-Sacker              | Torus bifurcation                                  |
 | PD    | Period doubling             | Flip bifurcation                                   |
 | BP    | Branch point                |                                                    |
 | CP    | Cusp bifurcation            |                                                    |
 | BT    | Bogdanov-Takens             |                                                    |
 | ZH    | Zero-Hopf                   | Fold-Hopf, Saddle-node Hopf, Gavrilov-Guckenheimer |
 | HH    | Double Hopf                 | Hopf-Hopf bifurcation                              |
 | GH    | Generalised Hopf            | Bautin                                             |
 | BPC   | Branch point of cycles      |                                                    |
 | CPC   | Cusp point of cycles        |                                                    |
 | CH    | Chenciner                   | Generalised Neimark-Sacker bifurcation             |
 | LPNS  | Fold-Neimark-Sacker         |                                                    |
 | PDNS  | Flip-Neimark-Sacker         |                                                    |
 | LPPD  | Fold-flip                   |                                                    |
 | NSNS  | Double Neimark-Sacker       |                                                    |
 | GPD   | Generalised period doubling |                                                    |

 (Taken from the [[http://www.scholarpedia.org/article/MATCONT][MATCONT Scholarpedia]] page)

*** TODO Types of curve

 | Curve label | Curve type                        | MATCONT | CoCo | AUTO | PyDSTool |
 |-------------+-----------------------------------+---------+------+------+----------|
 | EP-C        | Equilibrium                       | y       |      | y    | y        |
 | LP-C        | Limit point / fold                | y       |      | y    | y        |
 | H-C1        | Hopf (method 1)                   | y       |      | y    | y        |
 | H-C2        | Hopf (method 2)                   | -       |      | -    | y        |
 | LC-C        | Limit cycle curve (family of POs) | y       |      | y    | y        |
 |             | Limit point of cycles             | y       |      | ?    | ?        |
 |             | Period doubling                   | y       |      | y    | **       |
 |             | Neimark-Sacker                    | y       |      | y    | **       |
 |             | Homoclinic to saddle              | y       |      | y    | n        |
 |             | Homoclinic to saddle-node         | y       |      | y    | n        |
 | *           | Branch point                      | y       |      |      |          |
 | *           | Branch point of cycles            | y       |      |      |          |
 | *           | ConnectionSaddle                  | y       |      |      |          |
 | *           | ConnectionSaddleNode              | y       |      |      |          |
 | *           | HomotopySaddle                    | y       |      |      |          |
 | *           | HomotopySaddleNode                | y       |      |      |          |
 | *           | ConnectionHet                     | y       |      |      |          |
 | *           | HomotopyHet                       | y       |      |      |          |
 | *           | Heteroclinic                      | y       |      |      |          |

  \* What do thes mean? Are they actually a bifurcation curve type?
  \** PyDSTool seems to have methods to compute these for fixed points of maps; does that mean they're a maps-only type of curve? Note that it lacks documentation and tests/examples about these methods, so maybe they're not implemented?
  ? indicates that there doesn't appear to be a native way of doing this, however it's possible that there's ways to do it (eg. AUTO97 apparently let's us track LPCs, and PyDSTool let's us define custom curves to follow, so one could possibly construct a customised continuation regime to track limit points of cycles)

*** TODO Types of point

 | Point type | Codim | MATCONT | CoCo | XPP | PyDSTool |
 |------------+-------+---------+------+-----+----------|
 | LP         |     1 | y       |      | y   | y        |
 | H          |     1 | y       |      | y   | y        |
 | LPC        |     1 | y       |      |     | y        |
 | NS         |     1 | y       |      |     | y        |
 | Torus bif  |       |         |      | y   |          |
 | PD         |     1 | y       |      | y   | y        |
 | BP         |     2 | y       |      | y   | y        |
 | CP         |     2 | y       |      |     | y        |
 | BT         |     2 | y       |      |     | y        |
 | ZH         |     2 | y       |      |     | y        |
 | HH         |     2 | y       |      |     | y        |
 | GH         |     2 | y       |      |     | y        |
 | BPC        |     2 | y       |      |     | n        |
 | CPC        |     2 | y       |      |     | n        |
 | CH         |     2 | y       |      |     | n        |
 | LPNS       |     2 | y       |      |     | n        |
 | PDNS       |     2 | y       |      |     | n        |
 | LPPD       |     2 | y       |      |     | n        |
 | NSNS       |     2 | y       |      |     | n        |
 | GPD        |     2 | y       |      |     | n        |

 \* Are branch points just 'there's a bifurcation here but we don't know what type specifically'? In that case, any bifurcation that occurs, but isn't one of the labelled ones, would still be detected as a BP.
 Also see the MATCONT 'objects related to homoclinics to equilibria' table, and resonances, for additional points it can detect

*** TODO Available numerical methods

 | Method | MATCONT | CoCo | XPP | PyDSTool |
 |--------+---------+------+-----+----------|
 |        |         |      |     |          |

*** TODO Types of system they can simulate

 | System            | MATCONT | CoCo | XPP                | PyDSTool |
 |-------------------+---------+------+--------------------+----------|
 | ODE               |         |      | y                  | y        |
 | PDE (discretized) |         |      | y                  | n        |
 | DDE               |         |      | y                  | limited  |
 | SDE               |         |      | y                  | limited  |
 | DAE               |         |      | y                  | y        |
 | BVP               |         |      | y                  | n        |
 | Maps              |         |      | y                  | y        |
 | Hybrid            |         |      | basic (apparently) | y        |
 | Integral          |         |      | y                  | n        |
 | Difference        |         |      | y                  | y        |
 | Functional        |         |      | y                  | n        |

 *While XPP is capable of simulating all the noted systems, I don't know if that is literally just XPP simulating them, or also that AUTO is able to run continuations with them*

 Aren't difference equations the same as maps?

*** TODO Degree of manual fiddling / parameter tuning
*** To code or not code?
   
 | MATCONT             | XPP                 | PyDSTool                 | CoCo                     |
 |---------------------+---------------------+--------------------------+--------------------------|
 | No coding necessary | No coding necessary | Coding required (matlab) | Coding required (matlab) |

*** License

 | MATCONT                                         | XPP        | PyDSTool     | CoCo                                    |
 |-------------------------------------------------+------------+--------------+-----------------------------------------|
 | Creative commons, but requires a matlab license | GNU GPL v3 | BSD 3 clause | None specified; matlab license required |

 There might be the option of running matcont or CoCo in GNU Octave, meaning no matlab license is required, but this is not a given.

*** TODO Crashing and instability / ease of use
