supervision/feb1010wk5wk6/meeting_notes.tex
\subsection{Tables}
\label{sec:org1e980f4}
\subsubsection{Point labels}
\label{sec:org6567192}

\begin{center}
\begin{tabular}{lll}
Point & Label & Also known as\\
\hline
EP & Equilibrium & \\
LC & Limit cycle & \\
LP & Limit point & Fold bifurcation, saddle node bifurcation\\
H & Hopf & Andronov-Hopf bifurcation\\
LPC & Limit point of cycles & Fold / saddle node bifurcation of periodics\\
NS & Neimark-Sacker & Torus bifurcation\\
PD & Period doubling & Flip bifurcation\\
BP & Branch point & \\
CP & Cusp bifurcation & \\
BT & Bogdanov-Takens & \\
ZH & Zero-Hopf & Fold-Hopf, Saddle-node Hopf, Gavrilov-Guckenheimer\\
HH & Double Hopf & Hopf-Hopf bifurcation\\
GH & Generalised Hopf & Bautin\\
BPC & Branch point of cycles & \\
CPC & Cusp point of cycles & \\
CH & Chenciner & Generalised Neimark-Sacker bifurcation\\
LPNS & Fold-Neimark-Sacker & \\
PDNS & Flip-Neimark-Sacker & \\
LPPD & Fold-flip & \\
NSNS & Double Neimark-Sacker & \\
GPD & Generalised period doubling & \\
\end{tabular}
\end{center}

(Taken from the \href{http://www.scholarpedia.org/article/MATCONT}{MATCONT Scholarpedia} page)

\subsubsection{{\bfseries\sffamily TODO} Types of curve}
\label{sec:org7daba9e}

\begin{center}
\begin{tabular}{llllll}
Curve label & Curve type & MATCONT & CoCo & AUTO & PyDSTool\\
\hline
EP-C & Equilibrium & y &  & y & y\\
LP-C & Limit point / fold & y &  & y & y\\
H-C1 & Hopf (method 1) & y &  & y & y\\
H-C2 & Hopf (method 2) & - &  & - & y\\
LC-C & Limit cycle curve (family of POs) & y &  & y & y\\
 & Limit point of cycles & y &  & ? & ?\\
 & Period doubling & y &  & y & **\\
 & Neimark-Sacker & y &  & y & **\\
 & Homoclinic to saddle & y &  & y & n\\
 & Homoclinic to saddle-node & y &  & y & n\\
* & Branch point & y &  &  & \\
* & Branch point of cycles & y &  &  & \\
* & ConnectionSaddle & y &  &  & \\
* & ConnectionSaddleNode & y &  &  & \\
* & HomotopySaddle & y &  &  & \\
* & HomotopySaddleNode & y &  &  & \\
* & ConnectionHet & y &  &  & \\
* & HomotopyHet & y &  &  & \\
* & Heteroclinic & y &  &  & \\
\end{tabular}
\end{center}

$\backslash$* What do thes mean? Are they actually a bifurcation curve type?
$\backslash$** PyDSTool seems to have methods to compute these for fixed points of maps; does that mean they're a maps-only type of curve? Note that it lacks documentation and tests/examples about these methods, so maybe they're not implemented?
? indicates that there doesn't appear to be a native way of doing this, however it's possible that there's ways to do it (eg. AUTO97 apparently let's us track LPCs, and PyDSTool let's us define custom curves to follow, so one could possibly construct a customised continuation regime to track limit points of cycles)

\subsubsection{{\bfseries\sffamily TODO} Types of point}
\label{sec:orgf48b850}

\begin{center}
\begin{tabular}{lrllll}
Point type & Codim & MATCONT & CoCo & XPP & PyDSTool\\
\hline
LP & 1 & y &  & y & y\\
H & 1 & y &  & y & y\\
LPC & 1 & y &  &  & y\\
NS & 1 & y &  &  & y\\
Torus bif &  &  &  & y & \\
PD & 1 & y &  & y & y\\
BP & 2 & y &  & y & y\\
CP & 2 & y &  &  & y\\
BT & 2 & y &  &  & y\\
ZH & 2 & y &  &  & y\\
HH & 2 & y &  &  & y\\
GH & 2 & y &  &  & y\\
BPC & 2 & y &  &  & n\\
CPC & 2 & y &  &  & n\\
CH & 2 & y &  &  & n\\
LPNS & 2 & y &  &  & n\\
PDNS & 2 & y &  &  & n\\
LPPD & 2 & y &  &  & n\\
NSNS & 2 & y &  &  & n\\
GPD & 2 & y &  &  & n\\
\end{tabular}
\end{center}

$\backslash$* Are branch points just 'there's a bifurcation here but we don't know what type specifically'? In that case, any bifurcation that occurs, but isn't one of the labelled ones, would still be detected as a BP.
Also see the MATCONT 'objects related to homoclinics to equilibria' table, and resonances, for additional points it can detect

\subsubsection{{\bfseries\sffamily TODO} Available numerical methods}
\label{sec:org1bc89a0}

\begin{center}
\begin{tabular}{lllll}
Method & MATCONT & CoCo & XPP & PyDSTool\\
\hline
 &  &  &  & \\
\end{tabular}
\end{center}

\subsubsection{{\bfseries\sffamily TODO} Types of system they can simulate}
\label{sec:org4e5b641}

\begin{center}
\begin{tabular}{lllll}
System & MATCONT & CoCo & XPP & PyDSTool\\
\hline
ODE &  &  & y & y\\
PDE (discretized) &  &  & y & n\\
DDE &  &  & y & limited\\
SDE &  &  & y & limited\\
DAE &  &  & y & y\\
BVP &  &  & y & n\\
Maps &  &  & y & y\\
Hybrid &  &  & basic (apparently) & y\\
Integral &  &  & y & n\\
Difference &  &  & y & y\\
Functional &  &  & y & n\\
\end{tabular}
\end{center}

\textbf{While XPP is capable of simulating all the noted systems, I don't know if that is literally just XPP simulating them, or also that AUTO is able to run continuations with them}

Aren't difference equations the same as maps?

\subsubsection{{\bfseries\sffamily TODO} Degree of manual fiddling / parameter tuning}
\label{sec:org0e0c936}
\subsubsection{To code or not code?}
\label{sec:org23324af}

\begin{center}
\begin{tabular}{llll}
MATCONT & XPP & PyDSTool & CoCo\\
\hline
No coding necessary & No coding necessary & Coding required (matlab) & Coding required (matlab)\\
\end{tabular}
\end{center}

\subsubsection{License}
\label{sec:org563d0fb}

\begin{center}
\begin{tabular}{llll}
MATCONT & XPP & PyDSTool & CoCo\\
\hline
Creative commons, but requires a matlab license & GNU GPL v3 & BSD 3 clause & None specified; matlab license required\\
\end{tabular}
\end{center}

There might be the option of running matcont or CoCo in GNU Octave, meaning no matlab license is required, but this is not a given.

\subsubsection{{\bfseries\sffamily TODO} Crashing and instability / ease of use}
\label{sec:org5faf5ba}
