supervision/feb1010wk5wk6/meeting_notes.org
*** TODO Other stuff

 | Thing                          | MATCONT                                         | CoCo | XPP | PyDSTool |
 |--------------------------------+-------------------------------------------------+------+-----+----------|
 | Toolboxes                      | biomechanical, compneuro, systems biology       |      |     |          |
 | Auto C code generation         | Yes, for ODE/ DAE / map simulations             |      |     |          |
 | Bounds safety                  | Yes, can preserve eg. non-negativity            |      |     |          |
 | Index-free system              | Yes, making for clear syntax                    |      |     |          |
 | Extensible                     | Yes, can easily build on the code and expand it |      |     |          |
 | Heirarchical model composition | Yes                                             |      |     |          |
 | Events detection               | Yes                                             |      |     |          |
 | Symbolic manipulation          | Yes                                             |      |     |          |
 | Memory management utilities    | Yes, inc. LaTeX markup export, smbl conversion  |      |     |          |
 | Parameter estimation / fitting | Yes, toolboxes for that                         |      |     |          |

*** TODO PyDSTool vs others

 | PyDSTool                                    | XPP                                         | MATCONT                               |
 |---------------------------------------------+---------------------------------------------+---------------------------------------|
 | Arbitrarily large systems                   | No heirarchical composition-based modelling |                                       |
 | Wider range of DE RHS, but no stochastics   | Supports stochastic RHS                     |                                       |
 | SUpports long names                         | 9 character max. for names                  |                                       |
 | Scriptable                                  | Not scriptable                              |                                       |
 | Can embed simulations in other environments | Can only use as a standalone box            |                                       |
 | Limited DDE support                         | Supports general DDEs                       |                                       |
 | Fewer integrators than XPP                  | Supports more ODE integrators than PyDSTool |                                       |
 | No BVP solver                               | Has a BVP solver                            |                                       |
 | Slower than XPP, as fast as MATCONT         | Written in C / fortran. Fast!               | Slower than XPP, as fast as PyDSTool  |
 | Closer integration with the programming env | Hard to interface with other programming    | Harder to integrate with other coding |
 |                                             |                                             |                                       |
 #+BEGIN_EXPORT latex
 \newpage
 #+END_EXPORT
* COMMENT Burster bibliography and notes
** LITERATURE SUMMARY
  The literature spends a lot of time trying to classify bursting neurons into different causes for bursts.
  Bursting requires a fast-slow system.
  Rinzel (0) introduces the idea of a frozen fast system.
  Here, we take the limit as \(\epsilon \to 0\), such that the slow system stops changing.
  We treat the slow system state \(y\) as a bifurcation parameter of the fast system.
  The fast system will exhibit a variety of bifurcations under y.
  (Eg. a pair of saddle-node bifurcations, in the Fitzhugh-Naugmo model.)
  The slow variable, when reintroduced, acts as a driving force, which pushes the fast system over these different bifurcations.
   
  Consider the bifurcation set of a bursting system.
  Between each bifurcation point, there exists a stable invariant set.
  At the bifurcation point, an invariant set either disappears, or loses stability.
  The bursting system will trace a path from one invariant set to the next, as the slow subsystem evolves.
  This is all explained nicely in (1).
   
  (1) classifies bursters by the bifurcations at either end of the fast subsystem's hysteresis loop.
  (3) tries to improve Rinzel's (1) classification, by explaining all bursters as slices through an unfolding of a bifurcation.
  (3) considers all of the either-end bifurcations on a 2-parameter bifurcation diagram.
  Any given Rinzel bursting type is given by path / periodic motion / cut across this bifurcation diagram, with the either-end bifurcations being those which the cut passes through at the start and end. 
  This also allows the prediction of more burster types.
  It is noted that the 2d bifurcation diagram is typical of a system near a codim-3 degenerate Bogdanov-Takens bifurcation.

  (4) improves (3)'s classification method slightly, to classify bursters by the codimension of the unfolding in which they fist appear, as well as by the bifurcations.
  In doing so, it also classifies bursters from the literature as occuring in codim-3 bifurcation unfoldings.
  After (4) was written, psuedo-plateau bursters appeared, which can't be explained in terms of codim-3 unfoldings.
  Krasy's paper (2) extends the unfolding classification further, by adding psuedo-plateau bursters into the classification system.
  This is done by considering the codim-4 unfolding of a doubly degenerate bogdanov takens singularity.
  In studying this unfolding, a slow-subsystem path for psuedo-plaueau bursters is uncovered, as well as suggestions for how the systems bifurcate into regular square-wave (plaueau) bursters.
  The new (codim-4) unfolding also contains all the codim-3 bursters, and hence, (probably?) every type of known burster so far.

  Krasy's paper (2) provides some nice references for the history of explaning bursting.
  The general strategy, as mentioned in Krasy's paper, is to find an unfolding containing any relevant fast-subsystem bifurcations, and a path though the parameter space representing the forcing action of the slow variables.
   
  Krasy's paper uses the cubic Lienard system for the (frozen) fast subsystem, as it is one of the partial unfoldings of a doubly-degenerate Bogdanov Takens bifurcation.
  Since the paper only considers the frozen fast subsystem, it doesn't pay much attention to the slow system.
  A sinusoidal slow subsystem is suggested in the appendices; this forms a slow-wave burster (autonymously oscillating slow subsystem), however no hysteresis-loop slow subsystem is proposed.
  To make the model capable of hysteretic bursting, a different slow subsystem must also be defined.
  (5) therefore builds further on the work of (0)-(4), by using the same sort of classification scheme as gets developed, but by also adding in a model for a hysteretic slow subsystem.
  (The paper also provides a nice review of all the work up to that point, inc. Krasy's paper.)
  (IT ONLY SEEMS TO CONSIDER CODIM-3 [SINGLY] DEGENERATE TB SINGULARITIES; IF SO, THE MODEL CAN'T EXHIBIT KRASSY'S PSUEDO-PLATEAU BURSTING.)

** [[https://link.springer.com/article/10.1186/2190-8567-1-12][Dynamics of plateau bursting in pituitary cells (lots of nice refs)]]
*** Reference
Teka, Wondimu, et al. "The dynamics underlying pseudo-plateau bursting in a pituitary cell model." The Journal of Mathematical Neuroscience 1.1 (2011): 12.

*** BibTeX
@article{teka2011dynamics,
  title={The dynamics underlying pseudo-plateau bursting in a pituitary cell model},
  author={Teka, Wondimu and Tabak, Jo{\"e}l and Vo, Theodore and Wechselberger, Martin and Bertram, Richard},
  journal={The Journal of Mathematical Neuroscience},
  volume={1},
  number={1},
  pages={12},
  year={2011},
  publisher={Springer}
}

*** Abstract
Pituitary cells of the anterior pituitary gland secrete hormones in
response to patterns of electrical activity. Several types of
pituitary cells produce short bursts of electrical activity which are
more effective than single spikes in evoking hormone release. These
bursts, called pseudo-plateau bursts, are unlike bursts studied
mathematically in neurons (plateau bursting) and the standard
fast-slow analysis used for plateau bursting is of limited use. Using
an alternative fast-slow analysis, with one fast and two slow
variables, we show that pseudo-plateau bursting is a canard-induced
mixed mode oscillation. Using this technique, it is possible to
determine the region of parameter space where bursting occurs as well
as salient properties of the burst such as the number of spikes in the
burst. The information gained from this one-fast/two-slow
decomposition complements the information obtained from a
two-fast/one-slow decomposition.

*** Summary
   Neurons tend to burst because it's a more effective way of triggering hormone / neurotransmitter release than individual spikes.
   This paper looks at different mechanisms to bursting.
   Also contains lots of nice useful references about bursting!

** [[https://www.sciencedirect.com/science/article/pii/S0166223696100709][Neurons tend to burst because it's a more effective way of triggering hormone / neurotransmitter release than individual spikes]]
*** Reference
Lisman, John E. "Bursts as a unit of neural information: making unreliable synapses reliable." Trends in neurosciences 20.1 (1997): 38-43.
    
*** BibTeX
@article{lisman1997bursts,
  title={Bursts as a unit of neural information: making unreliable synapses reliable},
  author={Lisman, John E},
  journal={Trends in neurosciences},
  volume={20},
  number={1},
  pages={38--43},
  year={1997},
  publisher={Elsevier}
}

*** Abstract
Several lines of evidence indicate that brief ( < 25 ms) bursts of
high-frequency firing have special importance in brain function.
Recent work shows that many central synapses are surprisingly
unreliable at signaling the arrival of single presynaptic action
potentials to the postsynaptic neuron. However, bursts are reliably
signaled because transmitter release is facilitated. Thus, these
synapses can be viewed as filters that transmit bursts, but filter out
single spikes. Bursts appear to have a special role in synaptic
plasticity and information processing. In the hippocampus, a single
burst can produce long-term synaptic modifications. In brain
structures whose computational role is known, action potentials that
arrive in bursts provide more-precise information than action
potentials that arrive singly. These results, and the requirement for
multiple inputs to fire a cell suggest that the best stimulus for
exciting a cell (that is, a neural code) is coincident bursts.

*** Summary
   Synapses are unreliable, and bursting is the best way to get a signal to cross them.
   Acts as a filter and stuff.
   Lots of relevant neural information.

** (0) [[https://link.springer.com/content/pdf/10.1007/BFb0074739.pdf][Rinzel's introduction of the fast-slow freezing method to explain bursting]]
*** Reference
Rinzel, John. "Bursting oscillations in an excitable membrane model." Ordinary and partial differential equations. Springer, Berlin, Heidelberg, 1985. 304-316.

*** BibTeX
@incollection{rinzel1985bursting,
  title={Bursting oscillations in an excitable membrane model},
  author={Rinzel, John},
  booktitle={Ordinary and partial differential equations},
  pages={304--316},
  year={1985},
  publisher={Springer}
}

*** Abstract
Various nerve, muscle, and secretory cells exhibit complex electrical
activity which has been observed experimentally by using intracellular
electrodes to monitor the dynamics of the potential across the cell
membrane. Such activity may include single spikes (time scale, msec.)
in response to brief stimuli, repetitive spiking for a maintained
input, and repetitive bursts of spikes (time scale, sec) which may be
endogenous and modulated by chemical (e.g. hormonal) or electrical
stimuli. Pancreatic B­cells respond with periodic bursting in the
presence of glucose (3,13) and this activity is correlated with their
release of insulin (18). Figure 1 illustrates computed solutions of a
theoretical model (4) for such electrical behavior. The mathematical
model (based upon a biophysical model (2)) is an adapted and expanded
version of the classical Hodgkin­Huxley (11) description of nerve
excitability and involves five first­order nonlinear ordinary
differential equations. The time course of membrane potential V(Fig.
1, upper) exhibits spikes of roughly constant size (30­40mV) which
appear to ride on a plateau potential of approximately ­40 mV.
Following each "active phase" of spiking is a "silent phase" where V
slowly increases. The intracellular free calcium concentration Ca
(Fig. 1, lower) slowly increases (on the average) during the active
phase and slowly decreases during the silent phase. The dynamics of Ca
determine the time scale of the bursts. In this paper we present an
analysis and qualitative viewpoint of bursting for the Chay­Keizer
(C­K) theoretical model. We exploit the slow behavior of Ca by first
considering Ca as a parameter and studying its influence on the faster
spike­generating subsystem. Such spike generation dynamics are first
illustrated (Section 2) for a simplified model of excitable membrane
activity with Ca fixed. This two­variable, reduced HH, model yields
single spike and repetitive spike activity such as seen in the active
phase of bursting. In some parameter ranges it exhibits bistability in
which V may rest at a lower stable steady state or oscillate stably
around an upper (unstable) steady state. This latter behavior is also
in the repertoire of the four­variable HH subsystem in the C­K model
and it corresponds to the silent and active phases. Next we append to
the excitation subsystem the slow dynamics of Ca to account for
bursting.

** (1) [[http://www-sop.inria.fr/members/Mathieu.Desroches/files/Rinzel_ICM1986.pdf][Rinzel classifying bursting mechanisms in terms of the bifurcations exhibited by a neuron (intuitive description of fast-slow burster dynamics)]]
