supervision/feb1010wk5wk6/meeting_notes.tex
\subsubsection{{\bfseries\sffamily TODO} Other stuff}
\label{sec:org6b2a0b2}

\begin{center}
\begin{tabular}{lllll}
Thing & MATCONT & CoCo & XPP & PyDSTool\\
\hline
Toolboxes & biomechanical, compneuro, systems biology &  &  & \\
Auto C code generation & Yes, for ODE/ DAE / map simulations &  &  & \\
Bounds safety & Yes, can preserve eg. non-negativity &  &  & \\
Index-free system & Yes, making for clear syntax &  &  & \\
Extensible & Yes, can easily build on the code and expand it &  &  & \\
Heirarchical model composition & Yes &  &  & \\
Events detection & Yes &  &  & \\
Symbolic manipulation & Yes &  &  & \\
Memory management utilities & Yes, inc. \LaTeX{} markup export, smbl conversion &  &  & \\
Parameter estimation / fitting & Yes, toolboxes for that &  &  & \\
\end{tabular}
\end{center}

\subsubsection{{\bfseries\sffamily TODO} PyDSTool vs others}
\label{sec:org4a44701}

\begin{center}
\begin{tabular}{lll}
PyDSTool & XPP & MATCONT\\
\hline
Arbitrarily large systems & No heirarchical composition-based modelling & \\
Wider range of DE RHS, but no stochastics & Supports stochastic RHS & \\
SUpports long names & 9 character max. for names & \\
Scriptable & Not scriptable & \\
Can embed simulations in other environments & Can only use as a standalone box & \\
Limited DDE support & Supports general DDEs & \\
Fewer integrators than XPP & Supports more ODE integrators than PyDSTool & \\
No BVP solver & Has a BVP solver & \\
Slower than XPP, as fast as MATCONT & Written in C / fortran. Fast! & Slower than XPP, as fast as PyDSTool\\
Closer integration with the programming env & Hard to interface with other programming & Harder to integrate with other coding\\
 &  & \\
\end{tabular}
\end{center}
\newpage
\end{document}
